In [2]:
import nltk

In [3]:
//nltk.download_shell()

NLTK Downloader
---------------------------------------------------------------------------
    d) Download   l) List    u) Update   c) Config   h) Help   q) Quit
---------------------------------------------------------------------------
Downloader> q

In [4]:
import pandas as pd

In [5]:
reviewcontent=pd.read_csv('./reviewContent.txt', sep='\t',names=['userId','ProductId','date','reviewMsg'])

In [6]:
reviewcontent.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 608458 entries, 0 to 608457
Data columns (total 4 columns):
userId       608458 non-null int64
ProductId    608458 non-null int64
date         608458 non-null object
reviewMsg    608458 non-null object
dtypes: int64(2), object(2)
memory usage: 18.6+ MB

In [7]:
reviewcontent.head()

,userId,ProductId,date,reviewMsg
0,5044,0,2014-11-16,"Drinks were bad, the hot chocolate was watered..."
1,5045,0,2014-09-08,This was the worst experience I've ever had a ...
2,5046,0,2013-10-06,This is located on the site of the old Spruce ...
3,5047,0,2014-11-30,I enjoyed coffee and breakfast twice at Toast ...
4,5048,0,2014-08-28,I love Toast! The food choices are fantastic -...

In [8]:
reviewcontent.describe()

              userId      ProductId
count  608458.000000  608458.000000
mean    89645.550291    2565.019737
std     73874.394788    1447.877997
min      5044.000000       0.000000
25%     25497.000000    1345.000000
50%     66771.000000    2616.000000
75%    142275.750000    3768.000000
max    265320.000000    5043.000000

In [10]:
reviewcontent['length']=reviewcontent['reviewMsg'].apply(len)

In [11]:
reviewcontent.head()

,userId,ProductId,date,reviewMsg,length
0,5044,0,2014-11-16,"Drinks were bad, the hot chocolate was watered...",187
1,5045,0,2014-09-08,This was the worst experience I've ever had a ...,1375
2,5046,0,2013-10-06,This is located on the site of the old Spruce ...,257
3,5047,0,2014-11-30,I enjoyed coffee and breakfast twice at Toast ...,1318
4,5048,0,2014-08-28,I love Toast! The food choices are fantastic -...,808